InformationRegisters/ТелеграмСтатистика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмСтатистика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Принято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обновлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмЧатыПользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмСтатистика/Ext/ManagerModule.bsl
Процедура ОбновитьСтатистику(Бот, Чат, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмСтатистика.Принято
	|ИЗ
	|	РегистрСведений.ТелеграмСтатистика КАК ТелеграмСтатистика
	|ГДЕ
	|	ТелеграмСтатистика.Бот = &Бот
	|	И ТелеграмСтатистика.Чат = &Чат
	|	И ТелеграмСтатистика.Пользователь = &Пользователь";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Принято = 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Принято = Выборка.Принято;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ТелеграмСтатистика.СоздатьМенеджерЗаписи();
	МЗ.Бот = Бот;
	МЗ.Чат = Чат;
	МЗ.Пользователь = Пользователь;
	МЗ.Принято = Принято + 1;
	МЗ.Обновлено = ТекущаяДата();
	МЗ.Записать();
	
КонецПроцедуры
